   #                                                  Titanic Exercise 

   ![titanic](https://userscontent2.emaze.com/images/a5f68f37-6349-4065-a1fc-921cbe7401b2/958230111417e36d6b3c67ffd7bc3494.jpeg)
   #### Practise Pandas

First of all, import the needed libraries.

In [83]:


import numpy as np
import pandas as pd
import random
import matplotlib.pyplot as plt
import seaborn as sns
import random

1. Read in filename and call the variable `titanic`
    - Explore the `titanic` dataset using `info`, `dtypes` & `describe`

In [84]:
titanic = pd.read_csv("data/titanic.csv")
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [85]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [86]:
titanic.dtypes

pclass         int64
survived       int64
name          object
sex           object
age          float64
sibsp          int64
parch          int64
ticket        object
fare         float64
cabin         object
embarked      object
boat          object
body         float64
home.dest     object
dtype: object

In [87]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,33.295479,160.809917
std,0.837836,0.486055,14.413493,1.041658,0.865560,51.758668,97.696922
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000

2. Create a separate dataframe with the columns `['name', 'sex', 'age']`, call it `people`

It can be done two ways, do it both!

In [88]:
# [['...']] uso esa sintaxis para extraer varias columnas, lo que devuelve otro DataFrame.
people = titanic[["name","sex", "age"]]
people

                                                 name     sex    age
0                       Allen, Miss. Elisabeth Walton  female  29.00
1                      Allison, Master. Hudson Trevor    male   0.92
2                        Allison, Miss. Helen Loraine  female   2.00
3                Allison, Mr. Hudson Joshua Creighton    male  30.00
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00
...                                               ...     ...    ...
1304                             Zabour, Miss. Hileni  female  14.50
1305                            Zabour, Miss. Thamine  female    NaN
1306                        Zakarian, Mr. Mapriededer    male  26.50
1307                              Zakarian, Mr. Ortin    male  27.00
1308                               Zimmerman, Mr. Leo    male  29.00

[1309 rows x 3 columns]

In [89]:
# Para la segunda forma usamos loc
# : (dos puntos) en la parte de filas significa "seleccionar todas las filas".
# ["name", "sex", "age"] en la parte de columnas significa "seleccionar solo estas tres columnas".
people = titanic.loc[: , ["name","sex","age"]]
people

                                                 name     sex    age
0                       Allen, Miss. Elisabeth Walton  female  29.00
1                      Allison, Master. Hudson Trevor    male   0.92
2                        Allison, Miss. Helen Loraine  female   2.00
3                Allison, Mr. Hudson Joshua Creighton    male  30.00
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00
...                                               ...     ...    ...
1304                             Zabour, Miss. Hileni  female  14.50
1305                            Zabour, Miss. Thamine  female    NaN
1306                        Zakarian, Mr. Mapriededer    male  26.50
1307                              Zakarian, Mr. Ortin    male  27.00
1308                               Zimmerman, Mr. Leo    male  29.00

[1309 rows x 3 columns]

3. Print the output of `people` showing the first three rows and the last four rows, using `append`,`tail` and `head`

In [90]:
# Las 3 primeras filas
first_three_rows = people.head(3)

In [91]:
# Las 4 últimas columnas
last_four_rows = people.tail(4)

In [92]:
# append me da error porque ha sido eliminado en pandas v1.4.0 y versiones superiores

# result = first_three_rows.append(last_four_rows)  
# print(result)

In [93]:
# usamos el método concat en lugar de append
result = pd.concat([first_three_rows, last_four_rows])

print(result)

                                name     sex    age
0      Allen, Miss. Elisabeth Walton  female  29.00
1     Allison, Master. Hudson Trevor    male   0.92
2       Allison, Miss. Helen Loraine  female   2.00
1305           Zabour, Miss. Thamine  female    NaN
1306       Zakarian, Mr. Mapriededer    male  26.50
1307             Zakarian, Mr. Ortin    male  27.00
1308              Zimmerman, Mr. Leo    male  29.00

4. Slice the row from 3 to 9, call it `s_titanic`

In [94]:
# .iloc[] para selección por índice de posición
# Empieza en la fila con índice 3 (incluida). Termina en la fila con índice 10 (excluida).

s_titanic = titanic.iloc[3:10]
s_titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"

5. Slice the row from 40 to 63 in reverse order, call it `s_titanic_rev`

In [95]:
#  Inicia en la fila 63 (incluida). Termina en la fila 39 (pero excluye la fila 39).Se mueve en orden inverso (va restando 1 en cada paso).
s_titanic_rev = titanic.iloc[63:39:-1]  
print(s_titanic_rev)

    pclass  survived                                               name  \
63       1         1  Chaffee, Mrs. Herbert Fuller (Carrie Constance...
62       1         0                        Chaffee, Mr. Herbert Fuller
61       1         1  Cavendish, Mrs. Tyrell William (Julia Florence...
60       1         0                      Cavendish, Mr. Tyrell William
59       1         1  Cassebeer, Mrs. Henry Arthur Jr (Eleanor Genev...
58       1         0                             Case, Mr. Howard Brown
57       1         1          Carter, Mrs. William Ernest (Lucile Polk)
56       1         1                         Carter, Mr. William Ernest
55       1         1                          Carter, Miss. Lucile Polk
54       1         1                Carter, Master. William Thornton II
53       1         0                             Carrau, Mr. Jose Pedro
52       1         0                            Carrau, Mr. Francisco M
51       1         0                           Carlsson, Mr. Frans Olof
50       1         1  Cardeza, Mrs. James Warburton Martinez (Charlo...
49       1         1                 Cardeza, Mr. Thomas Drake Martinez
48       1         1   Candee, Mrs. Edward (Helen Churchill Hungerford)
47       1         1                  Calderhead, Mr. Edward Pennington
46       1         0                              Cairns, Mr. Alexander
45       1         0                  Butt, Major. Archibald Willingham
44       1         1                    Burns, Miss. Elizabeth Margaret
43       1         1    Bucknell, Mrs. William Robert (Emma Eliza Ward)
42       1         1     Brown, Mrs. John Murray (Caroline Lane Lamson)
41       1         1          Brown, Mrs. James Joseph (Margaret Tobin)
40       1         0                          Brewe, Dr. Arthur Jackson

       sex   age  sibsp  parch       ticket      fare        cabin embarked  \
63  female  47.0      1      0  W.E.P. 5734   61.1750          E31        S
62    male  46.0      1      0  W.E.P. 5734   61.1750          E31        S
61  female  76.0      1      0        19877   78.8500          C46        S
60    male  36.0      1      0        19877   78.8500          C46        S
59  female   NaN      0      0        17770   27.7208          NaN        C
58    male  49.0      0      0        19924   26.0000          NaN        S
57  female  36.0      1      2       113760  120.0000      B96 B98        S
56    male  36.0      1      2       113760  120.0000      B96 B98        S
55  female  14.0      1      2       113760  120.0000      B96 B98        S
54    male  11.0      1      2       113760  120.0000      B96 B98        S
53    male  17.0      0      0       113059   47.1000          NaN        S
52    male  28.0      0      0       113059   47.1000          NaN        S
51    male  33.0      0      0          695    5.0000  B51 B53 B55        S
50  female  58.0      0      1     PC 17755  512.3292  B51 B53 B55        C
49    male  36.0      0      1     PC 17755  512.3292  B51 B53 B55        C
48  female  53.0      0      0     PC 17606   27.4458          NaN        C
47    male  42.0      0      0     PC 17476   26.2875          E24        S
46    male   NaN      0      0       113798   31.0000          NaN        S
45    male  45.0      0      0       113050   26.5500          B38        S
44  female  41.0      0      0        16966  134.5000          E40        C
43  female  60.0      0      0        11813   76.2917          D15        C
42  female  59.0      2      0        11769   51.4792         C101        S
41  female  44.0      0      0     PC 17610   27.7208           B4        C
40    male   NaN      0      0       112379   39.6000          NaN        C

   boat   body                                       home.dest
63    4    NaN                                      Amenia, ND
62  NaN    NaN                                      Amenia, ND
61    6    NaN                         Little Onn Hall, Staffs
60  NaN  172.0                         Little Onn Hall, Staffs
59    5    NaN                                    New York, NY
58  NaN    NaN                Ascot, Berkshire / Rochester, NY
57    4    NaN                                   Bryn Mawr, PA
56    C    NaN                                   Bryn Mawr, PA
55    4    NaN                                   Bryn Mawr, PA
54    4    NaN                                   Bryn Mawr, PA
53  NaN    NaN                             Montevideo, Uruguay
52  NaN    NaN                             Montevideo, Uruguay
51  NaN    NaN                                    New York, NY
50    3    NaN                    Germantown, Philadelphia, PA
49    3    NaN  Austria-Hungary / Germantown, Philadelphia, PA
48    6    NaN                                  Washington, DC
47    5    NaN                                    New York, NY
46  NaN    NaN                                             NaN
45  NaN    NaN                                  Washington, DC
44    3    NaN                                             NaN
43    8    NaN                                Philadelphia, PA
42    D    NaN                                     Belmont, MA
41    6    NaN                                      Denver, CO
40  NaN    NaN                                Philadelphia, PA

6. Slice the columns from the starting column to `'parch'`, call it `left_columns`

In [96]:
# titanic.loc[: , :"parch"] seleccionamos todas las filas (:), pero solo las columnas desde el inicio hasta la columna 'parch'.


left_columns = titanic.loc[: , :"parch"]
left_columns

,pclass,survived,name,sex,age,sibsp,parch
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2
...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0

7. Slice the columns from `'name'` to `'age'`, call it `middle_columns`

In [97]:
middle_columns = titanic.loc[:, 'name':'age']
print(middle_columns)

                                                 name     sex    age
0                       Allen, Miss. Elisabeth Walton  female  29.00
1                      Allison, Master. Hudson Trevor    male   0.92
2                        Allison, Miss. Helen Loraine  female   2.00
3                Allison, Mr. Hudson Joshua Creighton    male  30.00
4     Allison, Mrs. Hudson J C (Bessie Waldo Daniels)  female  25.00
...                                               ...     ...    ...
1304                             Zabour, Miss. Hileni  female  14.50
1305                            Zabour, Miss. Thamine  female    NaN
1306                        Zakarian, Mr. Mapriededer    male  26.50
1307                              Zakarian, Mr. Ortin    male  27.00
1308                               Zimmerman, Mr. Leo    male  29.00

[1309 rows x 3 columns]

8. Slice the columns from `'ticket'` to the end, call it `right_columns`

In [98]:
# .loc[:, 'ticket':] selecciona todas las filas (:) pero solo las columnas desde 'ticket' hasta el final
right_columns = titanic.loc[:, 'ticket':]
print(right_columns)

      ticket      fare    cabin embarked boat   body  \
0      24160  211.3375       B5        S    2    NaN
1     113781  151.5500  C22 C26        S   11    NaN
2     113781  151.5500  C22 C26        S  NaN    NaN
3     113781  151.5500  C22 C26        S  NaN  135.0
4     113781  151.5500  C22 C26        S  NaN    NaN
...      ...       ...      ...      ...  ...    ...
1304    2665   14.4542      NaN        C  NaN  328.0
1305    2665   14.4542      NaN        C  NaN    NaN
1306    2656    7.2250      NaN        C  NaN  304.0
1307    2670    7.2250      NaN        C  NaN    NaN
1308  315082    7.8750      NaN        S  NaN    NaN

                            home.dest
0                        St Louis, MO
1     Montreal, PQ / Chesterville, ON
2     Montreal, PQ / Chesterville, ON
3     Montreal, PQ / Chesterville, ON
4     Montreal, PQ / Chesterville, ON
...                               ...
1304                              NaN
1305                              NaN
1306                              NaN
1307                              NaN
1308                              NaN

[1309 rows x 7 columns]

9. What is the name of the oldest person who died in the Titanic? Was he or she travelling alone or had any family travelling with them?

In [99]:
# Hacemos un filtro y buscamos los pasajeros que que no sobrevivieron.
# Condición booleana, va a devolver True solo para las filas donde el valor en la columna survived sea 0
# (lo que significa que la persona falleció).
pasajeros_fallecidos = titanic[titanic['survived'] == 0]

# Buscamos al pasajero más viejo entre los que no sobrevivieron. USamos loc, filtramos por la columna age
# y con el método idxmax tendremos el índice (posición) de la fila con el valor máximo de la columna.
pasajero_mayor_edad = pasajeros_fallecidos.loc[pasajeros_fallecidos['age'].idxmax()]

# Nombre del pasajero más viejo y si viajaba solo o con familia
nombre = pasajero_mayor_edad['name']
sibsp = pasajero_mayor_edad['sibsp']
parch = pasajero_mayor_edad['parch']
# cojo la edad solo por propia consulta
edad = pasajero_mayor_edad['age']
# hacemos una condición para saber si viajaba solo o con familia
if sibsp > 0 or parch > 0:
    familia = 'con familia'
else:
    familia = 'solo'

print(f"La persona más vieja que murió en el Titanic es {nombre}. Viajaba {familia}.")

print(edad)

La persona más vieja que murió en el Titanic es Svensson, Mr. Johan. Viajaba solo.
74.0

In order to give an answer to the second question you should find out which columns give you that info. Usually part of your job as a Data Scientist will be get to know the dataset which you are working with. In this case the columns which give you that info are the following: 
        - 'sibsp' Number of Siblings/Spouses Aboard
        - 'parch' Number of Parents/Children Aboard

10. Create the list of 5 random numbers of rows from 0 to the lenght of the dataframe, call it `rows`

ex. `rows = [3,7,99,52,48]` use `random` library

In [100]:
# Con random, cojo una muestra de 5 dentro del rango especificado por la longitud del DataSet
rows = random.sample(range(len(titanic)), 5)

print(rows)

[871, 1012, 691, 310, 1044]

This list of numbers are random, could be different.

11. Create the list of three column labels, call it `cols`

In [101]:
cols = ["name", "age", "sex"]

12. Use both lists `rows` and `cols` to create a new dataframe

In [102]:
new_dataframe = titanic.loc[rows, cols]
new_dataframe

                                 name   age     sex
871                  Horgan, Mr. John   NaN    male
1012           McNeill, Miss. Bridget   NaN  female
691   Brocklebank, Mr. William Alfred  35.0    male
310          Wick, Mr. George Dennick  57.0    male
1044               Murphy, Miss. Nora   NaN  female

13. Create a boolean array with the condition of being a woman or a man, using the `sex` column, where **female** is True. Call it `array_fe`

In [103]:
array_fe = titanic["sex"] == "female"

print(array_fe)

0        True
1       False
2        True
3       False
4        True
        ...
1304     True
1305     True
1306    False
1307    False
1308    False
Name: sex, Length: 1309, dtype: bool

14. Rename the column `"sex"` to `"gender"` and filter the `titanic` dataframe with the boolean array, call it `woman_titanic`

In [104]:
# Primero renombrar sex a gender, con el método rename
titanic.rename(columns={'sex': 'gender'}, inplace=True)

# filtro por lo que nos ha devuelto el array generado en el anterior ejercicio
woman_titanic = titanic[array_fe]

print(woman_titanic)

      pclass  survived                                             name  \
0          1         1                    Allen, Miss. Elisabeth Walton
2          1         0                     Allison, Miss. Helen Loraine
4          1         0  Allison, Mrs. Hudson J C (Bessie Waldo Daniels)
6          1         1                Andrews, Miss. Kornelia Theodosia
8          1         1    Appleton, Mrs. Edward Dale (Charlotte Lamson)
...      ...       ...                                              ...
1286       3         1  Whabee, Mrs. George Joseph (Shawneene Abi-Saab)
1290       3         1                 Wilkes, Mrs. James (Ellen Needs)
1300       3         1          Yasbeck, Mrs. Antoni (Selini Alexander)
1304       3         0                             Zabour, Miss. Hileni
1305       3         0                            Zabour, Miss. Thamine

      gender   age  sibsp  parch  ticket      fare    cabin embarked boat  \
0     female  29.0      0      0   24160  211.3375       B5        S    2
2     female   2.0      1      2  113781  151.5500  C22 C26        S  NaN
4     female  25.0      1      2  113781  151.5500  C22 C26        S  NaN
6     female  63.0      1      0   13502   77.9583       D7        S   10
8     female  53.0      2      0   11769   51.4792     C101        S    D
...      ...   ...    ...    ...     ...       ...      ...      ...  ...
1286  female  38.0      0      0    2688    7.2292      NaN        C    C
1290  female  47.0      1      0  363272    7.0000      NaN        S  NaN
1300  female  15.0      1      0    2659   14.4542      NaN        C  NaN
1304  female  14.5      1      0    2665   14.4542      NaN        C  NaN
1305  female   NaN      1      0    2665   14.4542      NaN        C  NaN

       body                        home.dest
0       NaN                     St Louis, MO
2       NaN  Montreal, PQ / Chesterville, ON
4       NaN  Montreal, PQ / Chesterville, ON
6       NaN                       Hudson, NY
8       NaN              Bayside, Queens, NY
...     ...                              ...
1286    NaN                              NaN
1290    NaN                              NaN
1300    NaN                              NaN
1304  328.0                              NaN
1305    NaN                              NaN

[466 rows x 14 columns]

15. How many woman were younger than 18? Call the variable `minor_wo`

In [105]:
minor_wo = woman_titanic[woman_titanic['age'] < 18]

count_minor_wo = minor_wo.shape[0]

print(count_minor_wo)

72

16. How many woman that were less than 18 actually died? Call the variable `dead_wo`

In [106]:
dead_wo = minor_wo[minor_wo["survived"]==0]

count_dead_wo = dead_wo.shape[0]

print(count_dead_wo)

22

17. Drop rows with *Nan* in `titanic` with `how='any'` and print the shape

In [107]:
print(titanic.isna().sum())

pclass          0
survived        0
name            0
gender          0
age           263
sibsp           0
parch           0
ticket          0
fare            1
cabin        1014
embarked        2
boat          823
body         1188
home.dest     564
dtype: int64

In [108]:
# Quitamos las filas con cualquier Nan, con el método dropna
titanic_clean = titanic.dropna(how="any")

print(titanic_clean.shape)

(0, 14)

18. Drop rows with *Nan* in `titanic` with `how='all'` and print the shape

In [109]:
# Quitamos las filas con cualquier Nan, con el método dropna
titanic_clean = titanic.dropna(how="all")

print(titanic_clean.shape)

(1309, 14)

Check in [here](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html) why the shapes are different.

19. Drop columns in `titanic` with more than 1000 missing values and print the columns remaining

In [110]:
# Miro el número de valores que faltan en cada columna, cisna() y sum() los valores faltantes en cada columna.
missing_values = titanic.isna().sum()

# Elimino las columnas con más de 1000 valores faltantes
titanic_clean = titanic.drop(columns=missing_values[missing_values > 1000].index)

print(titanic_clean.columns)

Index(['pclass', 'survived', 'name', 'gender', 'age', 'sibsp', 'parch',
       'ticket', 'fare', 'embarked', 'boat', 'home.dest'],
      dtype='object')

20. Calculate the ratio of missing values at the `boat` column.

In [ ]:
# Primero miro los valores faltantes en la columna boat
# isna devuelve un valor booleano (True o False) por cada fila en la columna, indicando si ese valor es NaN o no.
# Con sum, sumamos los valores True (ya que True se cuenta como 1), lo que nos da el número total de valores faltantes en la columna.
missing_values_boat = titanic['boat'].isna().sum()

print(missing_values_boat)
print()
# Calcular el número total de filas 
total_rows = len(titanic)

# Para calcular el ratio, lo guardo el missing_ratio, y hago el missing_values_boat(que ya está calculado)
# lo dividimos por el total de filas y lo multiplicamos x 100
# Multiplicamos por 100 para convertir un número decimal (ratio) en porcentaje
missing_ratio = missing_values_boat / total_rows * 100

print(f"El ratio de valores faltantes en la columna 'boat' es: {missing_ratio:.2f}%")

823

El ratio de valores faltantes en la columna 'boat' es: 62.87%

21.  Group `titanic` by `'pclass'` and aggregate by the columns `age` & `fare`, by `max` and `median` and assign it to `by_class`

In [119]:
# Agrupar por 'pclass' y aplicar las funciones de agregación 'max' y 'median' a 'age' y 'fare'
by_class = titanic.groupby('pclass')[['age', 'fare']].agg(["max", "median"]).round(3)

# Imprimir el resultado
print(by_class)

         age            fare
         max median      max  median
pclass
1       80.0   39.0  512.329  60.000
2       70.0   29.0   73.500  15.046
3       74.0   24.0   69.550   8.050

22. Print the maximum age in each class from `by_class`

In [121]:
# Selecciono la columna 'age' de by_class y accedemos a la edad máxima de los valores máximos de edad por clase.
print(by_class['age']['max'])

pclass
1    80.0
2    70.0
3    74.0
Name: max, dtype: float64

23. Print the median fare in each class from `by_class`

In [122]:
# Imprimimos la tarifa mediana de cada clase
print(by_class['fare']['median'])

pclass
1    60.000
2    15.046
3     8.050
Name: median, dtype: float64

24. Using [`.pivot_table()`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.pivot_table.html) to count how many women or men survived by class, call it `counted`.

Don't panic and read the documentation!

25. Add a new column with the sum of survived men and women, call it `counted['total']`

26. Sort `counted` by the `'total'` column. In which class the people survived the most?

27. Please, show only the rows using a mask with the following conditions: 
    - They are woman
    - From third class
    - Younger than 30
    - They survived
    
    ¿How many rows fulfill the condition?

28. Now, show only the rows using `.loc` with the following conditions: 
    - They are man
    - From first class
    - Older than 50
    - They died
    
    ¿How many rows fulfill the condition?

29. Print the uniques values at the column `'name'`

30. Find if was there any `name` repeated at the Titanic?

Hint: There were two people with the same name, who?

31. Using `matplotlib` find the appropriate visualization to show the distribution of the column `'age'`

32. Using `matplotlib` find the appropriate plot to visualize the column `'gender'`

32b. What if you also plot the column `'gender'` using the function [`countplot`](https://seaborn.pydata.org/generated/seaborn.countplot.html) from the library [`seaborn`](https://seaborn.pydata.org/)?

Remember you have never used `seaborn` before, therefore you should install it before importing it.

33. Using the function [`catplot`](https://seaborn.pydata.org/generated/seaborn.catplot.html) from the library `seaborn`, find out if the hypothesis _"Women are more likely to survive shipwrecks"_ is true or not.

34. Using [`kdeplot`]("https://seaborn.pydata.org/generated/seaborn.kdeplot.html") from `seaborn` represent those who not survived distributed by age.<>

Hint: First you should "filter" the `titanic` dataset where the column "survived" is 0, indexing the column `"age"` only.

Arguments you should pass to the function: 

    - color = "red"
    - label = "Not Survived"
    - shade = True
    
You should get something like this:

![kdeplot](./img/kdeplotsur.png)